DeviceTvmSoftwareInventory
| extend tostring(mv = strcat(SoftwareVendor, " - ", SoftwareName, " - ", SoftwareVersion))
| summarize TotalDevices=dcount(DeviceName) by mv
| extend var=split(mv, " - ")
| mv-expand Custom_SoftwareVendor=var[0], Custom_SoftwareName=var[1], Custom_SoftwareVersion=var[2]
| project-away mv, var
| project Custom_SoftwareVendor, Custom_SoftwareName, Custom_SoftwareVersion, TotalDevices
| order by tostring(Custom_SoftwareVendor)
